#+title: Readme

** Edit the main page to display a tic-tac-toe grid (no state yet)
:LOGBOOK:
CLOCK: [2025-09-22 Mon 11:39]--[2025-09-22 Mon 12:04] =>  0:25
:END:
It’s OK if it looks ugly!

The gameplan here is to simply show an SVG.
- [X] Install tree-sitter grammars
- [X] Display the SVG

*** Learn how to Dynamic SVG
:LOGBOOK:
CLOCK: [2025-09-22 Mon 15:33]--[2025-09-22 Mon 15:58] =>  0:25
CLOCK: [2025-09-22 Mon 14:19]--[2025-09-22 Mon 14:44] =>  0:25
CLOCK: [2025-09-22 Mon 13:53]--[2025-09-22 Mon 14:18] =>  0:25
CLOCK: [2025-09-22 Mon 12:26]--[2025-09-22 Mon 12:47] =>  0:21
:END:

[[https://dev.to/mondal10/dynamic-svg-component-in-vite-react-ts-3pih][source]]
This source seems to be more about /manipulating/ external static SVGs. Hmm.

We are going to use the canvas HTML element, maybe?
